W6D5/ninety_nine_cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
  def index
      @cats = Cat.all