W6D3/FirstRoute/app/controllers/users_controller.rb

    def create
        # user = User.new(params.require(:user).permit(:name, :email))
        # replace the `user_attributes_here` with the actual attribute keys
        # user = {name: "Steve", email: "steve@aa.edu"}
        # user = User.new(name: "Steve", email: "steve@aa.edu")
        # debugger
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Steve"], ["email", "steve@aa.edu"], ["created_at", "2020-10-07 20:04:42.494737"], ["updated_at", "2020-10-07 20:04:42.494737"]]