W6D4/FirstRoute/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 8]]
---
    def create
        # artwork = artwork.new(params.require(:artwork).permit(:name, :email))
        # replace the `artwork_attributes_here` with the actual attribute keys
        # artwork = {name: "Steve", email: "steve@aa.edu"}
        # artwork = artwork.new(name: "Steve", email: "steve@aa.edu")

        artwork_share = ArtworkShare.new(artwork_params)
        if artwork_share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 3]]
---
    def destroy
        # debugger
        artwork_share = ArtworkShare.find(params[:id])
        artwork_share.destroy